<?php

/**
 * Бесконечная арифметическая прогрессия с первым членом start и шагом step.
 */
function count()
{
}

/**
 * Возвращает по одному значению из последовательности, повторенной бесконечное число раз.
 */
function cycle()
{
}


/**
 * Повторение елемента n - раз
 */
function repeat()
{
}

/**
 * Аккумулирование сумм
 */
function accumulate()
{
}

/**
 * Поэлементное возращение значений входящих итераторов
 */
function chain()
{
}

/**
 * Комбинация определенной длины из итератора без повторяющихся значений
 */
function combinations()
{
}

/**
 * Комбинация определенной длины из итератора с повторяющимися значениями
 */
function combinations_with_replacement()
{
}
